will-rigby/STM32F410RBT6-WaterQualitySensor/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  William Rigby
 * @version V1.0
 * @date    20-January-2017
 * @brief   Water Quality Sensor Main
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
/* STM32F4 HAL Libraries */
#include "stm32f4xx.h"

/* C Libraries */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

/* Application Specific Libraries */
#include "stm32f410_fault_indicator.h"
#include "stm32f410_1wire.h"
#include "stm32f410_ultrasonic_rangefinder.h"
#include "stm32f410_uart.h"
#include "stm32f410_sim5320a.h"
#include "stm32f410_i2c.h"
#include "stm32f410_atlas_scientific.h"
#include "stm32f410_rtc.h"

/* Private variables ---------------------------------------------------------*/
/* Global Board Settings */
char serverIPAddress[21]; //"125.168.189.226";"128.173.221.22"
char serverPort[6]; //"4523" "2727"
char accessPoint[21]; // telstra.wap "NXTGENPHONE
char mobileNumber[13]; // = "+61423037656"; "+17577752179"
char boardName[21]; //"UQ Board 1" "RIGBI"
int32_t delayTime = 15; // Interval in seconds between messages
uint8_t tcpEnabled = 1; // Enables sending data over TCP
uint8_t dataCollectionMode = 0; // Specifies Collection Mode 0 = 1 sample per interval
uint8_t sendDataOverSMS = 0; // Send the data over SMS as well
uint16_t dataCollectionNumber = 0; // Keeps track of the sample number

/* Real Time Clock Variables */
RTC_HandleTypeDef hrtc;
//static __IO

/* Private function prototypes -----------------------------------------------*/
/* Hardware Functions */
void SystemClock_Config(void);
void Hardware_Init(void);
void MX_RTC_Init(void);

/* Process Incoming Messages from SMS or TCP Function*/
uint8_t process_message_bank_ip(char message[200]);
uint8_t process_message_bank_port(char message[200]);
uint8_t process_message_bank_name(char message[200]);
uint8_t process_message_bank_number(char message[200]);
uint8_t process_message_bank_apn(char message[200]);
uint8_t process_message_bank_interval(char message[200]);
void process_message_bank(char messageBank[5][200], uint8_t numberOfMessages);
void process_tcp_commands(char messageBank[200]);

/* Data Collection Functions */
void data_collect_measurement_per_interval(void);
void data_capture_and_transmission(void);
uint8_t connect_to_tcp(void);
uint8_t udp_packet(char* data);
uint8_t close_connection(void);
uint16_t low_mem_string_length(char* str);
void getDecStr(char* str, uint8_t len, uint16_t val);

/* Main Function */
int main(void) {

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Enable Interrupts */

	/* Initialize all configured peripherals */
	Hardware_Init();

	/* Set Default Values */
	sprintf(boardName, "UQ Board 1");
	sprintf(serverIPAddress, "125.168.189.226");
	sprintf(serverPort, "4523");
	sprintf(accessPoint, "telstra.wap");
	delayTime = 15;

	/* Data Collection Loop */
	while (1) {

		stm32f410_uart_usart2_transmit("BEGINNING TRANSMISSION\r\n");
		/* Turn on the SIM5320a  */
		sim5320a_power_on();

		/* Turn on the SIM5320a  */
		if (sim5320a_activate() == 0) {

			sim5320a_activate_sms();
			char messageBank[5][200];
			uint8_t numberOfMessages = sim5320a_check_sms_messages(messageBank);
			process_message_bank(messageBank, numberOfMessages);
			sim5320a_set_default_parameters(accessPoint, serverPort,
					serverIPAddress);

			/* Get data */

			/* Get Temperature */
			int16_t temperature[2];
			char temperatureString[2][10];
			onewire_read_ds18b20_temp_int16(temperature);
			getDecStr(temperatureString[0], 10, temperature[0]);
			getDecStr(temperatureString[1], 10, temperature[1]);

			/* Calibrate Temperature Sensors */
			char calibStr[20];
			calibStr[0] = 'T';
			calibStr[1] = ',';
			uint8_t i = 0;
			uint8_t j = 2;
			while (temperatureString[0][i] != 0) {
				calibStr[j] = temperatureString[0][i];
				i++;
				j++;
				if (i == 10) {
					break;
				}
			}
			calibStr[j] = '.';
			i = 0;
			while (temperatureString[1][i] != 0) {
				calibStr[j] = temperatureString[1][i];
				i++;
				j++;
				if (i == 10) {
					break;
				}
			}
			stm32f410_as_temp_calib_pH(calibStr, j);
			stm32f410_as_temp_calib_conductivity(calibStr, j);

			/* Read pH */
			char pH[20]; //read_ph_adc();
			stm32f410_as_read_pH(pH, 10);

			/* Read Conductivity */
			char conductivity[20]; //read_conductivity_adc();
			stm32f410_as_read_conductivity(conductivity, 10);
			uint8_t ph0 = 1;
			uint8_t cond0 = 1;
			for (int i = 0; i < 10; i++) {
				if (pH[i] != 0) {
					ph0 = 0;
				}
				if (conductivity[0] != 0) {
					cond0 = 0;
				}
			}
			if (cond0) {
				conductivity[0] = '0';
			}
			if (ph0) {
				pH[0] = '0';
			}

			/* Read Depth */
			uint16_t ultrasonic = read_ultrasonic_adc();
			char ultrasonicString[6];
			getDecStr(ultrasonicString, 6, ultrasonic);

			/* Read Signal Quality */
			uint8_t signalQuality = sim5320a_signal_quality();
			char sigQual[5];
			getDecStr(sigQual, 5, signalQuality);

			/* Read Battery Status */
			uint8_t batteryStatus = sim5320a_battery_percent();
			char batStat[5];
			getDecStr(batStat, 5, batteryStatus);

			/* Create Message */
			char dataCollectionNumberString[6];
			getDecStr(dataCollectionNumberString, 6, dataCollectionNumber);

			uint16_t dataLength = 16; // ,' ' and \r\n and . in temp
			dataLength += low_mem_string_length(boardName);
			dataLength += low_mem_string_length(dataCollectionNumberString);
			dataLength += low_mem_string_length(temperatureString[0]);
			dataLength += low_mem_string_length(temperatureString[1]);
			dataLength += low_mem_string_length(conductivity);
			dataLength += low_mem_string_length(pH);
			dataLength += low_mem_string_length(ultrasonicString);
			dataLength += low_mem_string_length(sigQual);
			dataLength += low_mem_string_length(batStat);

			/* Format and send data over TCP*/
			if (connect_to_tcp() == 0) {

				/* Send Actual Message */
				char messageLength[5]; // length of data
				getDecStr(messageLength, 5, dataLength);

				stm32f410_uart_usart1_transmit("AT+CIPSEND=0,");
				stm32f410_uart_usart1_transmit(messageLength);
				stm32f410_uart_usart1_transmit("\r\n");
				HAL_Delay(100);

				stm32f410_uart_usart1_transmit(boardName);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(dataCollectionNumberString);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(temperatureString[0]);
				stm32f410_uart_usart1_transmit(".");
				stm32f410_uart_usart1_transmit(temperatureString[1]);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(conductivity);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(pH);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(ultrasonicString);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(sigQual);
				stm32f410_uart_usart1_transmit(", ");

				stm32f410_uart_usart1_transmit(batStat);
				stm32f410_uart_usart1_transmit("\r\n");

