will-rigby/STM32F410RBT6-WaterQualitySensor/src/main.c
				HAL_Delay(500);

				char messageFromTCPServer[200];
				HAL_Delay(10000); // Wait seconds for a reply

				/* Get any messages from TCP Server if there are any */
				stm32f410_uart_get_usart1_reply(messageFromTCPServer, 200);
				process_tcp_commands(messageFromTCPServer);

				/* Close the TCP Server connection */
				close_connection();

			}
			dataCollectionNumber++;
		} else {
			/* Error */
			stm32f410_uart_usart2_transmit("Connect Failed.");
			for (int i = 0; i < 10; i++) {
				fault_indicator_on();
				HAL_Delay(200);
				fault_indicator_off();
				HAL_Delay(200);
				fault_indicator_on();
				HAL_Delay(200);
				fault_indicator_off();
				HAL_Delay(800);
			}
		}
		sim5320a_power_off();

		/* Disable all peripherals and sleep */
		//HAL_ADC_DeInit(&rangeFinderAdc);
		stm32f410_as_pH_sleep();
		stm32f410_as_conductivity_sleep();

		/* Enter Sleep */
		stm32f410_rtc_program_wakeup((uint16_t) delayTime);
		stm32f410_rtc_enter_stop();

		/* On Wake Up */
		HAL_Init();
		SystemClock_Config();
		stm32f410_rtc_exit_stop();
		Hardware_Init();

	}
}

/** System Clock Configuration
 */
void SystemClock_Config(void) {

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE()
	;

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = 16;
	RCC_OscInitStruct.PLL.PLLN = 128;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	RCC_OscInitStruct.PLL.PLLR = 2;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1);

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

void MX_RTC_Init(void) {

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;

	/**Initialize RTC Only
	 */
	hrtc.Instance = RTC;
	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv = 127;
	hrtc.Init.SynchPrediv = 255;
	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
	HAL_RTC_Init(&hrtc);

	/**Initialize RTC and set the Time and Date
	 */
	if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != 0x32F2) {
		sTime.Hours = 0x0;
		sTime.Minutes = 0x0;
		sTime.Seconds = 0x0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_RESET;
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD);

		sDate.WeekDay = RTC_WEEKDAY_MONDAY;
		sDate.Month = RTC_MONTH_JANUARY;
		sDate.Date = 0x1;
		sDate.Year = 0x0;

		HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD);

		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0x32F2);
	}
	/**Enable the WakeUp
	 *
	 */
	HAL_RTCEx_SetWakeUpTimer(&hrtc, 300, RTC_WAKEUPCLOCK_CK_SPRE_16BITS);
	HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, 300, RTC_WAKEUPCLOCK_CK_SPRE_16BITS);

}

void Hardware_Init(void) {
	HAL_Delay(50);
	__HAL_RCC_GPIOH_CLK_ENABLE()
	;

	fault_indicator_init();
	ultrasonic_rangefinder_init();
	//MX_RTC_Init();
	stmf410_uart_usart1_init();
	stmf410_uart_usart2_init();
	oneWire_init();
	sim5320a_init();
	stm32f410_i2c_bitbang_init();
	stm32f410_rtc_init();

}

uint8_t process_message_bank_ip(char message[200]) {
	/* Check for SETIP="123.123.123.123" */
	char ip[21];
	for (uint8_t i = 0; i < 21; i++) {
		ip[i] = 0;
	}
	for (uint8_t n = 0; n < 192; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'I')
				&& (message[n + 4] == 'P')) {
			uint8_t x = n + 7;
			uint8_t y = 0;

			/* Extract IP Address */
			while (message[x] != 34 && y < 15) {
				ip[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */
			for (uint8_t i = 0; i < 21; i++) {
				serverIPAddress[i] = ip[i];
			}
		}
	}
	return 0;
}

uint8_t process_message_bank_port(char message[200]) {
	/* Extract Port from SETPORT="1234" */
	char port[6];
	for (uint8_t i = 0; i < 6; i++) {
		port[i] = 0;
	}
	for (uint8_t n = 0; n < 190; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'P')
				&& (message[n + 4] == 'O') && (message[n + 5] == 'R')
				&& (message[n + 6] == 'T')) {
			uint8_t x = n + 9;
			uint8_t y = 0;

			/* Extract PORT Address */
			while (message[x] != 34 && y < 6) {
				port[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */
			for (uint8_t i = 0; i < 6; i++) {
				serverPort[i] = port[i];
			}
			return 1;
		}
	}
	return 0;
}

uint8_t process_message_bank_name(char message[200]) {
	char name[21];
	for (uint8_t i = 0; i < 21; i++) {
		name[i] = 0;
	}
	for (uint8_t n = 0; n < 190; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'N')
				&& (message[n + 4] == 'A') && (message[n + 5] == 'M')
				&& (message[n + 6] == 'E')) {
			uint8_t x = n + 9;
			uint8_t y = 0;

			/* Extract PORT Address */
			while (message[x] != 34 && y < 20) {
				name[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */

			for (uint8_t i = 0; i < 21; i++) {
				boardName[i] = name[i];
			}
			return 1;
		}
	}
	return 0;
}

