will-rigby/STM32F410RBT6-WaterQualitySensor/src/main.c
uint8_t process_message_bank_number(char message[200]) {
	char mNumber[13];
	for (uint8_t i = 0; i < 13; i++) {
		mNumber[i] = 0;
	}
	for (uint8_t n = 0; n < 188; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'M')
				&& (message[n + 4] == 'O') && (message[n + 5] == 'B')
				&& (message[n + 6] == 'I') && (message[n + 7] == 'L')
				&& (message[n + 8] == 'E')) {
			uint8_t x = n + 11;
			uint8_t y = 0;

			/* Extract PORT Address */
			while (message[x] != 34 && y < 12) {
				mNumber[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */

			for (uint8_t i = 0; i < 13; i++) {
				mobileNumber[i] = mNumber[i];
			}
			return 1;
		}
	}
	return 0;
}

uint8_t process_message_bank_apn(char message[200]) {
	char apn[21];
	memset(apn, 0, 21);
	for (uint8_t n = 0; n < 181; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'A')
				&& (message[n + 4] == 'P') && (message[n + 5] == 'N')
				&& (message[n + 6] == '=') && (message[n + 7] == 34)) {
			uint8_t x = n + 8;
			uint8_t y = 0;

			/* Extract APN  */
			while (message[x] != 34 && y < 20) {
				apn[y] = message[x];
				x++;
				y++;
			}

			/* Set APN and break from this statement */
			memcpy(accessPoint, apn, 21);
			return 1;
		}
	}
	return 0;
}

uint8_t process_message_bank_interval(char message[200]) {
	char delay[5];
	for (uint8_t i = 0; i < 5; i++) {
		delay[i] = 0;
	}
	for (uint8_t n = 0; n < 189; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'D')
				&& (message[n + 4] == 'E') && (message[n + 5] == 'L')
				&& (message[n + 6] == 'A') && (message[n + 7] == 'Y')) {
			uint8_t x = n + 10;
			uint8_t y = 0;

			/* Extract PORT Address */
			while (message[x] != 34 && y < 5) {
				delay[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */
			uint16_t dTime = 0;
			for (uint16_t z = 0; z < low_mem_string_length(delay); z++) {
				dTime = dTime * 10 + (delay[z] - 48);
			}
			delayTime = dTime;
			return 1;
		}
	}
	return 0;
}

uint8_t process_message_bank_enable_tcp(char message[200]) {
	char delay[5];
	memset(delay, 0, 5);
	for (uint8_t n = 0; n < 189; n++) {
		if ((message[n] == 'S') && (message[n + 1] == 'E')
				&& (message[n + 2] == 'T') && (message[n + 3] == 'D')
				&& (message[n + 4] == 'E') && (message[n + 5] == 'L')
				&& (message[n + 6] == 'A') && (message[n + 7] == 'Y')) {
			uint8_t x = n + 10;
			uint8_t y = 0;

			/* Extract PORT Address */
			while (message[x] != 34 && y < 5) {
				delay[y] = message[x];
				x++;
				y++;
			}

			/* Set IP and break from this statement */
			uint16_t dTime = 0;
			for (int z = 0; z < low_mem_string_length(delay); z++) {
				dTime = dTime * 10 + (delay[z] - 48);
			}
			if (dTime > 30) {
				delayTime = dTime;
			} else {
				delayTime = 30;
			}
			return 1;
		}
	}
	return 0;
}

void process_message_bank(char messageBank[5][200], uint8_t numberOfMessages) {
	for (int i = 0; i < numberOfMessages; i++) {
		process_message_bank_ip(messageBank[i]);
		process_message_bank_port(messageBank[i]);
		process_message_bank_name(messageBank[i]);
		process_message_bank_number(messageBank[i]);
		process_message_bank_apn(messageBank[i]);
		process_message_bank_interval(messageBank[i]);

	}
	if (numberOfMessages > 0) {

		sim5320a_send_text_message(mobileNumber, "Settings Updated");
	}
}

void process_tcp_commands(char messageBank[200]) {
	uint8_t commandUpdated = 0;
	commandUpdated = commandUpdated | process_message_bank_ip(messageBank);
	commandUpdated = commandUpdated | process_message_bank_port(messageBank);
	commandUpdated = commandUpdated | process_message_bank_name(messageBank);
	commandUpdated = commandUpdated | process_message_bank_number(messageBank);
	commandUpdated = commandUpdated | process_message_bank_apn(messageBank);
	commandUpdated = commandUpdated
			| process_message_bank_interval(messageBank);
	if (commandUpdated) {

		sim5320a_tcp_send_data("Updated Settings");
	}
}

void data_collect_measurement_per_interval(void) {

	/* Restart all Peripherals */
	uint32_t startTime = HAL_GetTick();

	stm32f410_uart_usart2_transmit("BEGINNING TRANSMISSION\r\n");
	/* Turn on the SIM5320a  */
	sim5320a_power_on();

	/* Turn on the SIM5320a  */
	if (sim5320a_activate() == 0) {

		sim5320a_activate_sms();
		char messageBank[5][200];
		uint8_t numberOfMessages = sim5320a_check_sms_messages(messageBank);
		process_message_bank(messageBank, numberOfMessages);
		sim5320a_set_default_parameters(accessPoint, serverPort,
				serverIPAddress);

		/* Get data */
		char pH[20]; //read_ph_adc();
		stm32f410_as_read_pH(pH, 10);

		char conductivity[20]; //read_conductivity_adc();
		stm32f410_as_read_conductivity(conductivity, 10);
		uint8_t ph0 = 1;
		uint8_t cond0 = 1;
		for (int i = 0; i < 10; i++) {
			if (pH[i] != 0) {
				ph0 = 0;
			}
			if (conductivity[0] != 0) {
				cond0 = 0;
			}
		}
		if (cond0) {
			conductivity[0] = '0';
		}
		if (ph0) {
			pH[0] = '0';
		}

		uint16_t ultrasonic = read_ultrasonic_adc();
		char ultrasonicString[6];
		getDecStr(ultrasonicString, 6, ultrasonic);

		int16_t temperature[2];
		char temperatureString[2][10];
		onewire_read_ds18b20_temp_int16(temperature);
		getDecStr(temperatureString[0], 10, temperature[0]);
		getDecStr(temperatureString[1], 10, temperature[1]);

		uint8_t signalQuality = sim5320a_signal_quality();
		char sigQual[5];
		getDecStr(sigQual, 5, signalQuality);

		uint8_t batteryStatus = sim5320a_battery_percent();
		char batStat[5];
		getDecStr(batStat, 5, batteryStatus);

		/* Message = BOARDNAME, DATACOLLECTIONNUMBER, TEMP1.TEMP2, conductivity, pH, range, bat, sig		 */
		/*                    12                    34    56            78  91     12   34   56 */
		/* Format and send data over TCP*/
		/* Create Message */
		char dataCollectionNumberString[6];
		getDecStr(dataCollectionNumberString, 6, dataCollectionNumber);

