will-rigby/STM32F410RBT6-WaterQualitySensor/src/main.c
		uint16_t dataLength = 16; // ,' ' and \r\n and . in temp
		dataLength += low_mem_string_length(boardName);
		dataLength += low_mem_string_length(dataCollectionNumberString);
		dataLength += low_mem_string_length(temperatureString[0]);
		dataLength += low_mem_string_length(temperatureString[1]);
		dataLength += low_mem_string_length(conductivity);
		dataLength += low_mem_string_length(pH);
		dataLength += low_mem_string_length(ultrasonicString);
		dataLength += low_mem_string_length(sigQual);
		dataLength += low_mem_string_length(batStat);

		if (connect_to_tcp() == 0) {

			/* Send Actual Message */
			char messageLength[5]; // length of data
			getDecStr(messageLength, 5, dataLength);

			stm32f410_uart_usart1_transmit("AT+CIPSEND=0,");
			stm32f410_uart_usart1_transmit(messageLength);
			stm32f410_uart_usart1_transmit("\r\n");
			HAL_Delay(100);

			stm32f410_uart_usart1_transmit(boardName);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(dataCollectionNumberString);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(temperatureString[0]);
			stm32f410_uart_usart1_transmit(".");
			stm32f410_uart_usart1_transmit(temperatureString[1]);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(conductivity);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(pH);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(ultrasonicString);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(sigQual);
			stm32f410_uart_usart1_transmit(", ");

			stm32f410_uart_usart1_transmit(batStat);
			stm32f410_uart_usart1_transmit("\r\n");

			HAL_Delay(500);

			char messageFromTCPServer[80];
			HAL_Delay(10000); // Wait seconds for a reply

			/* Get any messages from TCP Server if there are any */
			stm32f410_uart_get_usart1_reply(messageFromTCPServer, 80);
			process_tcp_commands(messageFromTCPServer);

			/* Close the TCP Server connection */
			close_connection();

		}
		dataCollectionNumber++;
	} else {
		/* Error */
		stm32f410_uart_usart2_transmit("Connect Failed.");
		for (int i = 0; i < 10; i++) {
			fault_indicator_on();
			HAL_Delay(200);
			fault_indicator_off();
			HAL_Delay(200);
			fault_indicator_on();
			HAL_Delay(200);
			fault_indicator_off();
			HAL_Delay(800);
		}
	}
	sim5320a_power_off();

	uint32_t measurementTime = (HAL_GetTick() - startTime) / 1000;
	stm32f410_uart_usart2_transmit("Transmission Completed\r\n");

	if (measurementTime < delayTime) {

		/* Disable all peripherals and sleep */
		HAL_ADC_DeInit(&rangeFinderAdc);
		stm32f410_as_pH_sleep();
		stm32f410_as_conductivity_sleep();
		for (int i = 0; i < delayTime; i++) {
			HAL_Delay(1000);
		}

		/* Enter Sleep *//*
		 stm32f410_rtc_program_wakeup((uint16_t) calculatedDelayInterval);
		 stm32f410_rtc_enter_stop();*/

		/* On Wake Up */
		//HAL_Init();
		//SystemClock_Config();
		//stm32f410_rtc_exit_stop();
		Hardware_Init();

	} else {
		HAL_Delay(1000);
	}
}

void data_capture_and_transmission(void) {

	while (1) {
		data_collect_measurement_per_interval();
	}
}

uint8_t connect_to_tcp(void) {
	char reply[80];
	uint16_t replyLength = 80;

	/* Define socket PDP context */
	stm32f410_uart_get_usart1_reply(reply, replyLength); // Clear Input Buffer

	stm32f410_uart_usart1_transmit("AT+CGSOCKCONT=1,\"IP\",\"");
	stm32f410_uart_usart1_transmit(accessPoint);
	stm32f410_uart_usart1_transmit("\"\r\n");
	HAL_Delay(100);

	/* Get Reply from PDP command */
	stm32f410_uart_get_usart1_reply(reply, replyLength);
	if ((reply[0] == '\r' && reply[1] == '\n' && reply[2] == 'O'
			&& reply[3] == 'K') == 0) {
		return (uint8_t) 1; // AT+CGSOCKCONT=1 Failed
	}

	/* Set TCP/IP Application Mode */
	stm32f410_uart_usart1_transmit("AT+CIPMODE=0\r\n");
	HAL_Delay(15);
	stm32f410_uart_get_usart1_reply(reply, replyLength);
	if ((reply[0] == '\r' && reply[1] == '\n' && reply[2] == 'O'
			&& reply[3] == 'K') == 0) {
		return (uint8_t) 2; // AT+CIPMODE=0 Failed
	}

	/* Start Data Network */
	stm32f410_uart_usart1_transmit("AT+NETOPEN\r\n");
	HAL_Delay(5000);
	stm32f410_uart_get_usart1_reply(reply, replyLength);
	if ((reply[9] == 'N' && reply[10] == 'E' && reply[11] == 'T'
			&& reply[12] == 'O' && reply[13] == 'P' && reply[14] == 'E'
			&& reply[15] == 'N' && reply[18] == '0') == 0) {
		return (uint8_t) 3; // NETOPEN Failed
	}

	/* Open TCP Connection to server */
	stm32f410_uart_usart1_transmit("AT+CIPOPEN=0,\"TCP\",\"");
	stm32f410_uart_usart1_transmit(serverIPAddress);
	stm32f410_uart_usart1_transmit("\",");
	stm32f410_uart_usart1_transmit(serverPort);
	stm32f410_uart_usart1_transmit("\r\n");
	HAL_Delay(1000);
	return 0;
}

uint8_t udp_packet(char* data) {
	char message[200]; // buffer to store message
	uint8_t messageLength = low_mem_string_length(data); // length of data

	sprintf(message, "AT+CIPSEND=0,%d,\"125.168.189.226\",4523\r\n",
			messageLength);
	stm32f410_uart_usart1_transmit(message);
	HAL_Delay(100);

	sprintf(message, "%s", data);
	stm32f410_uart_usart1_transmit(message);
	HAL_Delay(500);

	return 0;
}

uint8_t close_connection(void) {
	stm32f410_uart_usart1_transmit("AT+CIPCLOSE=0\r\n");
	HAL_Delay(600);

	stm32f410_uart_usart1_transmit("AT+NETCLOSE\r\n");
	HAL_Delay(100);

	/* Set internal flag to closed */

	return 0;
}

uint16_t low_mem_string_length(char* str) {
	uint16_t length = 0;
	while (str[length] != 0) {
		length++;
	}
	return length;
}

void getDecStr(char* str, uint8_t len, uint16_t val) {
	/*
	 uint8_t i;

	 for (i = 1; i <= len; i++) {
	 str[len - i] = (char) ((val % 10UL) + '0');
	 val /= 10;
	 }

	 str[i - 1] = '\0';
	 */
	if (val == 0) {
		str[0] = '0';
		for (uint8_t i = 1; i < len; i++) {
			str[i] = '\0';
		}
	} else {
		char remainders[20];
		/* Set Remainders array to null */
		int16_t x;
		int16_t i;
		for (x = 0; x < len; x++) {
			str[x] = '\0';
		}
		for (x = 0; x < 20; x++) {
			remainders[x] = '\0';
		}
		/* extract place values */
		for (i = 1; i <= len; i++) {
			remainders[i] = (char) ((val % 10) + '0');
			val /= 10;
		}
		i = 0;
		int16_t found = 0;
		int16_t y = 0;
		/* While null characters skip*/
		for (i = (len - 1); i >= 0; i--) {
			if ((found == 0) && (remainders[i] != '0')) {
				found = 1;
				str[y] = remainders[i];
				y++;
			} else if (found == 1) {
				str[y] = remainders[i];
				y++;
			}
			if (y == len) {
				return;
			}
		}

	}

}
